# Core utilities
brew "coreutils"
brew "grep"
brew "wget"
brew "curl"
brew "git"
brew "git-delta"  # Better git diffs
brew "tmux"
brew "neovim"
brew "fzf"        # Fuzzy finder
brew "tree"
brew "htop"

# Modern shell utilities
brew "eza"        # Modern replacement for ls (formerly exa)
brew "bat"        # Better cat
brew "fd"         # Better find
brew "ripgrep"    # Better grep
brew "jq"         # JSON processor
brew "yq"         # YAML processor

# Development tools
brew "go"
brew "golangci-lint"
brew "python"
brew "lazygit"    # Terminal UI for git

# Terminal tools
brew "zsh"
brew "starship"  # Cross-shell prompt

# Applications
cask "visual-studio-code"
cask "wezterm"
cask "ghostty"          # Modern terminal emulator
cask "jetbrains-toolbox"  # For GoLand, WebStorm, etc.
cask "raycast"           # Better spotlight replacement
cask "rectangle"         # Window management

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code"
cask "font-hack-nerd-font"
